[
  {
    "text": "Through the round of many births I roamed without reward, without rest, seeking the house-builder. Painful is birth again and again. House-builder, you're seen! You will not build a house again. All your rafters broken, the ridge pole dismantled, the mind has attained to the end of craving.",
    "source": "Dhammapada 153-154 (trans. Thanissaro Bhikkhu)",
    "tradition": "Theravada"
  },
  {
    "text": "Heedfulness: the path to the Deathless. Heedlessness: the path to death. The heedful do not die. The heedless are as if already dead.",
    "source": "Dhammapada 21 (trans. Thanissaro Bhikkhu)",
    "tradition": "Theravada"
  },
  {
    "text": "Greater in battle than the man who would conquer a thousand-thousand men, is he who would conquer just one — himself.",
    "source": "Dhammapada 103 (trans. Thanissaro Bhikkhu)",
    "tradition": "Theravada"
  },
  {
    "text": "See it as a bubble, see it as a mirage: one who regards the world this way the King of Death doesn't see.",
    "source": "Dhammapada 170 (trans. Thanissaro Bhikkhu)",
    "tradition": "Theravada"
  },
  {
    "text": "The non-doing of any evil, the performance of what's skillful, the cleansing of one's own mind: this is the teaching of the Awakened.",
    "source": "Dhammapada 183 (trans. Thanissaro Bhikkhu)",
    "tradition": "Theravada"
  },
  {
    "text": "Conquer anger with lack of anger; bad, with good; stinginess, with a gift; a liar, with truth.",
    "source": "Dhammapada 223 (trans. Thanissaro Bhikkhu)",
    "tradition": "Theravada"
  },
  {
    "text": "You yourselves must strive; the Buddhas only point the way.",
    "source": "Dhammapada 276 (trans. Thanissaro Bhikkhu)",
    "tradition": "Theravada"
  },
  {
    "text": "When you see with discernment, 'All fabrications are inconstant' — you grow disenchanted with stress. This is the path to purity.",
    "source": "Dhammapada 277 (trans. Thanissaro Bhikkhu)",
    "tradition": "Theravada"
  },
  {
    "text": "In reference to the seen, there will be only the seen. In reference to the heard, only the heard. In reference to the sensed, only the sensed. In reference to the cognized, only the cognized. When there is no you in connection with that, there is no you there. This, just this, is the end of stress.",
    "source": "Bahiya Sutta, Udana 1.10 (trans. Thanissaro Bhikkhu)",
    "tradition": "Theravada"
  },
  {
    "text": "There is that dimension where there is neither earth, nor water, nor fire, nor wind; neither dimension of the infinitude of space, nor dimension of the infinitude of consciousness, nor dimension of nothingness, nor dimension of neither perception nor non-perception; neither this world, nor the next world, nor sun, nor moon.",
    "source": "Nibbana Sutta, Udana 8.1 (trans. Thanissaro Bhikkhu)",
    "tradition": "Theravada"
  },
  {
    "text": "How very happily we live, we who have nothing. We will feed on rapture like the Radiant gods.",
    "source": "Dhammapada 200 (trans. Thanissaro Bhikkhu)",
    "tradition": "Theravada"
  },
  {
    "text": "Thus shall you think of all this fleeting world: a star at dawn, a bubble in a stream, a flash of lightning in a summer cloud, a flickering lamp, a phantom, and a dream.",
    "source": "Diamond Sutra, Chapter 32 (trans. A.F. Price)",
    "tradition": "Mahayana"
  },
  {
    "text": "Form is emptiness, emptiness is form. Emptiness is not other than form, form is not other than emptiness.",
    "source": "Heart Sutra (Prajnaparamita Hridaya)",
    "tradition": "Mahayana"
  },
  {
    "text": "Gate gate paragate parasamgate bodhi svaha. Gone, gone, gone beyond, gone altogether beyond. O what an awakening!",
    "source": "Heart Sutra (Prajnaparamita Hridaya)",
    "tradition": "Mahayana"
  },
  {
    "text": "Whatever joy there is in this world all comes from desiring others to be happy. Whatever suffering there is in this world all comes from desiring myself to be happy.",
    "source": "Shantideva, Bodhicharyavatara 8:129 (trans. Padmakara Translation Group)",
    "tradition": "Mahayana"
  },
  {
    "text": "Where would I find enough leather to cover the entire surface of the earth? But with leather soles beneath my feet, it's as if the whole world had been covered.",
    "source": "Shantideva, Bodhicharyavatara 5:13 (trans. Padmakara Translation Group)",
    "tradition": "Mahayana"
  },
  {
    "text": "Whatever is dependently co-arisen, that is explained to be emptiness. That, being a dependent designation, is itself the middle way.",
    "source": "Nagarjuna, Mulamadhyamakakarika 24:18 (trans. Jay Garfield)",
    "tradition": "Mahayana"
  },
  {
    "text": "The victorious ones have said that emptiness is the relinquishing of all views. For whomever emptiness is a view, that one has achieved nothing.",
    "source": "Nagarjuna, Mulamadhyamakakarika 13:8 (trans. Jay Garfield)",
    "tradition": "Mahayana"
  },
  {
    "text": "To study the Buddha Way is to study the self. To study the self is to forget the self. To forget the self is to be enlightened by the ten thousand dharmas. To be enlightened by the ten thousand dharmas is to free one's body and mind and those of others.",
    "source": "Dogen, Genjokoan (Shobogenzo)",
    "tradition": "Zen"
  },
  {
    "text": "Firewood becomes ash, and it does not become firewood again. Yet do not suppose that the ash is after and the firewood before.",
    "source": "Dogen, Genjokoan (Shobogenzo)",
    "tradition": "Zen"
  },
  {
    "text": "Enlightenment is like the moon reflected in the water. The moon does not get wet, nor is the water broken.",
    "source": "Dogen, Genjokoan (Shobogenzo)",
    "tradition": "Zen"
  },
  {
    "text": "What we call 'I' is just a swinging door which moves when we inhale and when we exhale.",
    "source": "Shunryu Suzuki, Zen Mind, Beginner's Mind",
    "tradition": "Zen"
  },
  {
    "text": "When you do something, you should burn yourself completely, like a good bonfire, leaving no trace of yourself.",
    "source": "Shunryu Suzuki, Zen Mind, Beginner's Mind",
    "tradition": "Zen"
  },
  {
    "text": "Nothing we see or hear is perfect. But right there in the imperfection is perfect reality.",
    "source": "Shunryu Suzuki, Zen Mind, Beginner's Mind",
    "tradition": "Zen"
  },
  {
    "text": "The Great Way is not difficult for those who do not pick and choose. When preferences are cast aside the Way stands clear and undisguised.",
    "source": "Sengcan, Hsin Hsin Ming (Verses on the Faith Mind)",
    "tradition": "Zen"
  },
  {
    "text": "A monk asked Joshu, 'Does a dog have Buddha-nature?' Joshu said, 'Mu.'",
    "source": "Mumonkan (Gateless Gate), Case 1",
    "tradition": "Zen"
  },
  {
    "text": "On this lump of red flesh there is a true person of no rank who is always going in and out of the face of every one of you.",
    "source": "Linji Yixuan, Record of Linji",
    "tradition": "Zen"
  },
  {
    "text": "All the Buddhas and all sentient beings are nothing but the One Mind, beside which nothing exists.",
    "source": "Huang Po, On the Transmission of Mind (trans. John Blofeld)",
    "tradition": "Zen"
  },
  {
    "text": "People are scared to empty their minds fearing that they will be engulfed by the void. What they don't realize is that their own mind is the void.",
    "source": "Huang Po, On the Transmission of Mind (trans. John Blofeld)",
    "tradition": "Zen"
  },
  {
    "text": "The thief left it behind: the moon at my window.",
    "source": "Ryokan",
    "tradition": "Zen"
  },
  {
    "text": "Who says my poems are poems? These poems are not poems. When you can understand this, then we can begin to speak of poetry.",
    "source": "Ryokan",
    "tradition": "Zen"
  },
  {
    "text": "Don't recall. Don't imagine. Don't think. Don't examine. Don't control. Rest.",
    "source": "Tilopa, Six Words of Advice (trans. Ken McLeod)",
    "tradition": "Tibetan"
  },
  {
    "text": "Without going anywhere, you'll arrive at the Buddha's ground. Without looking at anything, you'll see dharmakaya. Without achieving anything, your aim will be spontaneously accomplished.",
    "source": "Milarepa, The Hundred Thousand Songs",
    "tradition": "Tibetan"
  },
  {
    "text": "My religion is to live — and die — without regret.",
    "source": "Milarepa",
    "tradition": "Tibetan"
  },
  {
    "text": "If you are a poet, you will see clearly that there is a cloud floating in this sheet of paper. Without a cloud, there will be no rain; without rain, the trees cannot grow; and without trees, we cannot make paper.",
    "source": "Thich Nhat Hanh, The Heart of Understanding",
    "tradition": "Engaged"
  },
  {
    "text": "Feelings come and go like clouds in a windy sky. Conscious breathing is my anchor.",
    "source": "Thich Nhat Hanh, Stepping into Freedom",
    "tradition": "Engaged"
  },
  {
    "text": "No blame, no reasoning, no argument, just understanding. If you understand, and you show that you understand, you can love, and the situation will change.",
    "source": "Thich Nhat Hanh",
    "tradition": "Engaged"
  }
]
